MikroElektronika/core_packages/PIC/XC8/def/PIC16F18346/mcu.h
extern volatile TMR0Lbits_t TMR0Lbits __at(0x015);
// bitfield macros
#define _TMR0L_TMR0L_POSN                                   0x0
#define _TMR0L_TMR0L_POSITION                               0x0
#define _TMR0L_TMR0L_SIZE                                   0x8
#define _TMR0L_TMR0L_LENGTH                                 0x8
#define _TMR0L_TMR0L_MASK                                   0xFF
#define _TMR0L_TMR00_POSN                                   0x0
#define _TMR0L_TMR00_POSITION                               0x0
#define _TMR0L_TMR00_SIZE                                   0x1
#define _TMR0L_TMR00_LENGTH                                 0x1
#define _TMR0L_TMR00_MASK                                   0x1
#define _TMR0L_TMR01_POSN                                   0x1
#define _TMR0L_TMR01_POSITION                               0x1
#define _TMR0L_TMR01_SIZE                                   0x1
#define _TMR0L_TMR01_LENGTH                                 0x1
#define _TMR0L_TMR01_MASK                                   0x2
#define _TMR0L_TMR02_POSN                                   0x2
#define _TMR0L_TMR02_POSITION                               0x2
#define _TMR0L_TMR02_SIZE                                   0x1
#define _TMR0L_TMR02_LENGTH                                 0x1
#define _TMR0L_TMR02_MASK                                   0x4
#define _TMR0L_TMR03_POSN                                   0x3
#define _TMR0L_TMR03_POSITION                               0x3
#define _TMR0L_TMR03_SIZE                                   0x1
#define _TMR0L_TMR03_LENGTH                                 0x1
#define _TMR0L_TMR03_MASK                                   0x8
#define _TMR0L_TMR04_POSN                                   0x4
#define _TMR0L_TMR04_POSITION                               0x4
#define _TMR0L_TMR04_SIZE                                   0x1
#define _TMR0L_TMR04_LENGTH                                 0x1
#define _TMR0L_TMR04_MASK                                   0x10
#define _TMR0L_TMR05_POSN                                   0x5
#define _TMR0L_TMR05_POSITION                               0x5
#define _TMR0L_TMR05_SIZE                                   0x1
#define _TMR0L_TMR05_LENGTH                                 0x1
#define _TMR0L_TMR05_MASK                                   0x20
#define _TMR0L_TMR06_POSN                                   0x6
#define _TMR0L_TMR06_POSITION                               0x6
#define _TMR0L_TMR06_SIZE                                   0x1
#define _TMR0L_TMR06_LENGTH                                 0x1
#define _TMR0L_TMR06_MASK                                   0x40
#define _TMR0L_TMR07_POSN                                   0x7
#define _TMR0L_TMR07_POSITION                               0x7
#define _TMR0L_TMR07_SIZE                                   0x1
#define _TMR0L_TMR07_LENGTH                                 0x1
#define _TMR0L_TMR07_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR0L                  :8;
    };
    struct {
        unsigned TMR00                  :1;
        unsigned TMR01                  :1;
        unsigned TMR02                  :1;
        unsigned TMR03                  :1;
        unsigned TMR04                  :1;
        unsigned TMR05                  :1;
        unsigned TMR06                  :1;
        unsigned TMR07                  :1;
    };
} TMR0bits_t;
extern volatile TMR0bits_t TMR0bits __at(0x015);
// bitfield macros
#define _TMR0_TMR0L_POSN                                    0x0
#define _TMR0_TMR0L_POSITION                                0x0
#define _TMR0_TMR0L_SIZE                                    0x8
#define _TMR0_TMR0L_LENGTH                                  0x8
#define _TMR0_TMR0L_MASK                                    0xFF
#define _TMR0_TMR00_POSN                                    0x0
#define _TMR0_TMR00_POSITION                                0x0
#define _TMR0_TMR00_SIZE                                    0x1
#define _TMR0_TMR00_LENGTH                                  0x1
#define _TMR0_TMR00_MASK                                    0x1
#define _TMR0_TMR01_POSN                                    0x1
#define _TMR0_TMR01_POSITION                                0x1
#define _TMR0_TMR01_SIZE                                    0x1
#define _TMR0_TMR01_LENGTH                                  0x1
#define _TMR0_TMR01_MASK                                    0x2
#define _TMR0_TMR02_POSN                                    0x2
#define _TMR0_TMR02_POSITION                                0x2
#define _TMR0_TMR02_SIZE                                    0x1
#define _TMR0_TMR02_LENGTH                                  0x1
#define _TMR0_TMR02_MASK                                    0x4
#define _TMR0_TMR03_POSN                                    0x3
#define _TMR0_TMR03_POSITION                                0x3
#define _TMR0_TMR03_SIZE                                    0x1
#define _TMR0_TMR03_LENGTH                                  0x1
#define _TMR0_TMR03_MASK                                    0x8
#define _TMR0_TMR04_POSN                                    0x4
#define _TMR0_TMR04_POSITION                                0x4
#define _TMR0_TMR04_SIZE                                    0x1
#define _TMR0_TMR04_LENGTH                                  0x1
#define _TMR0_TMR04_MASK                                    0x10
#define _TMR0_TMR05_POSN                                    0x5
#define _TMR0_TMR05_POSITION                                0x5
#define _TMR0_TMR05_SIZE                                    0x1
#define _TMR0_TMR05_LENGTH                                  0x1
#define _TMR0_TMR05_MASK                                    0x20
#define _TMR0_TMR06_POSN                                    0x6
#define _TMR0_TMR06_POSITION                                0x6
#define _TMR0_TMR06_SIZE                                    0x1
#define _TMR0_TMR06_LENGTH                                  0x1
#define _TMR0_TMR06_MASK                                    0x40
#define _TMR0_TMR07_POSN                                    0x7
#define _TMR0_TMR07_POSITION                                0x7
#define _TMR0_TMR07_SIZE                                    0x1
#define _TMR0_TMR07_LENGTH                                  0x1
#define _TMR0_TMR07_MASK                                    0x80

// Register: TMR0H
#define TMR0H TMR0H
extern volatile unsigned char           TMR0H               __at(0x016);
#ifndef _LIB_BUILD
asm("TMR0H equ 016h");
#endif
// aliases
extern volatile unsigned char           _PR0                 __at(0x016);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PR0 equ 016h");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0H                  :8;
    };
    struct {
        unsigned TMR08                  :1;
        unsigned TMR09                  :1;
        unsigned TMR010                 :1;
        unsigned TMR011                 :1;
        unsigned TMR012                 :1;
        unsigned TMR013                 :1;
        unsigned TMR014                 :1;
        unsigned TMR015                 :1;
    };
    struct {
        unsigned _PR0                    :8;  // Note: Changed by MikroE
    };
} TMR0Hbits_t;
extern volatile TMR0Hbits_t TMR0Hbits __at(0x016);
// bitfield macros
#define _TMR0H_TMR0H_POSN                                   0x0
#define _TMR0H_TMR0H_POSITION                               0x0
#define _TMR0H_TMR0H_SIZE                                   0x8
#define _TMR0H_TMR0H_LENGTH                                 0x8
#define _TMR0H_TMR0H_MASK                                   0xFF
#define _TMR0H_TMR08_POSN                                   0x0
#define _TMR0H_TMR08_POSITION                               0x0
#define _TMR0H_TMR08_SIZE                                   0x1
#define _TMR0H_TMR08_LENGTH                                 0x1
#define _TMR0H_TMR08_MASK                                   0x1
#define _TMR0H_TMR09_POSN                                   0x1
#define _TMR0H_TMR09_POSITION                               0x1
#define _TMR0H_TMR09_SIZE                                   0x1
#define _TMR0H_TMR09_LENGTH                                 0x1
#define _TMR0H_TMR09_MASK                                   0x2
#define _TMR0H_TMR010_POSN                                  0x2
#define _TMR0H_TMR010_POSITION                              0x2
#define _TMR0H_TMR010_SIZE                                  0x1
#define _TMR0H_TMR010_LENGTH                                0x1
#define _TMR0H_TMR010_MASK                                  0x4
#define _TMR0H_TMR011_POSN                                  0x3
#define _TMR0H_TMR011_POSITION                              0x3
#define _TMR0H_TMR011_SIZE                                  0x1
#define _TMR0H_TMR011_LENGTH                                0x1
#define _TMR0H_TMR011_MASK                                  0x8
#define _TMR0H_TMR012_POSN                                  0x4
#define _TMR0H_TMR012_POSITION                              0x4
#define _TMR0H_TMR012_SIZE                                  0x1
#define _TMR0H_TMR012_LENGTH                                0x1
#define _TMR0H_TMR012_MASK                                  0x10
#define _TMR0H_TMR013_POSN                                  0x5
#define _TMR0H_TMR013_POSITION                              0x5
#define _TMR0H_TMR013_SIZE                                  0x1
#define _TMR0H_TMR013_LENGTH                                0x1
#define _TMR0H_TMR013_MASK                                  0x20
#define _TMR0H_TMR014_POSN                                  0x6
#define _TMR0H_TMR014_POSITION                              0x6
#define _TMR0H_TMR014_SIZE                                  0x1
#define _TMR0H_TMR014_LENGTH                                0x1
#define _TMR0H_TMR014_MASK                                  0x40
#define _TMR0H_TMR015_POSN                                  0x7
#define _TMR0H_TMR015_POSITION                              0x7
#define _TMR0H_TMR015_SIZE                                  0x1
#define _TMR0H_TMR015_LENGTH                                0x1
#define _TMR0H_TMR015_MASK                                  0x80
#define _TMR0H_PR0_POSN                                     0x0
#define _TMR0H_PR0_POSITION                                 0x0
#define _TMR0H_PR0_SIZE                                     0x8
#define _TMR0H_PR0_LENGTH                                   0x8
#define _TMR0H_PR0_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR0H                  :8;
    };
    struct {
        unsigned TMR08                  :1;
        unsigned TMR09                  :1;
        unsigned TMR010                 :1;
        unsigned TMR011                 :1;
        unsigned TMR012                 :1;
        unsigned TMR013                 :1;
        unsigned TMR014                 :1;
        unsigned TMR015                 :1;
    };
    struct {
        unsigned _PR0                    :8;  // Note: Changed by MikroE
    };
} PR0bits_t;
extern volatile PR0bits_t PR0bits __at(0x016);
// bitfield macros
#define _PR0_TMR0H_POSN                                     0x0
#define _PR0_TMR0H_POSITION                                 0x0
#define _PR0_TMR0H_SIZE                                     0x8
#define _PR0_TMR0H_LENGTH                                   0x8
#define _PR0_TMR0H_MASK                                     0xFF
#define _PR0_TMR08_POSN                                     0x0
#define _PR0_TMR08_POSITION                                 0x0
#define _PR0_TMR08_SIZE                                     0x1
#define _PR0_TMR08_LENGTH                                   0x1
#define _PR0_TMR08_MASK                                     0x1
#define _PR0_TMR09_POSN                                     0x1
#define _PR0_TMR09_POSITION                                 0x1
#define _PR0_TMR09_SIZE                                     0x1
#define _PR0_TMR09_LENGTH                                   0x1
#define _PR0_TMR09_MASK                                     0x2
#define _PR0_TMR010_POSN                                    0x2
#define _PR0_TMR010_POSITION                                0x2
#define _PR0_TMR010_SIZE                                    0x1
#define _PR0_TMR010_LENGTH                                  0x1
#define _PR0_TMR010_MASK                                    0x4
#define _PR0_TMR011_POSN                                    0x3
#define _PR0_TMR011_POSITION                                0x3
#define _PR0_TMR011_SIZE                                    0x1
#define _PR0_TMR011_LENGTH                                  0x1
#define _PR0_TMR011_MASK                                    0x8
#define _PR0_TMR012_POSN                                    0x4
#define _PR0_TMR012_POSITION                                0x4
#define _PR0_TMR012_SIZE                                    0x1
#define _PR0_TMR012_LENGTH                                  0x1
#define _PR0_TMR012_MASK                                    0x10
#define _PR0_TMR013_POSN                                    0x5
#define _PR0_TMR013_POSITION                                0x5
#define _PR0_TMR013_SIZE                                    0x1
#define _PR0_TMR013_LENGTH                                  0x1
#define _PR0_TMR013_MASK                                    0x20
#define _PR0_TMR014_POSN                                    0x6
#define _PR0_TMR014_POSITION                                0x6
#define _PR0_TMR014_SIZE                                    0x1
#define _PR0_TMR014_LENGTH                                  0x1
#define _PR0_TMR014_MASK                                    0x40
#define _PR0_TMR015_POSN                                    0x7
#define _PR0_TMR015_POSITION                                0x7
#define _PR0_TMR015_SIZE                                    0x1
#define _PR0_TMR015_LENGTH                                  0x1
#define _PR0_TMR015_MASK                                    0x80
#define _PR0_PR0_POSN                                       0x0
#define _PR0_PR0_POSITION                                   0x0
#define _PR0_PR0_SIZE                                       0x8
#define _PR0_PR0_LENGTH                                     0x8
#define _PR0_PR0_MASK                                       0xFF

// Register: T0CON0
#define T0CON0 T0CON0
extern volatile unsigned char           T0CON0              __at(0x017);
#ifndef _LIB_BUILD
asm("T0CON0 equ 017h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0OUTPS                :4;
        unsigned T016BIT                :1;
        unsigned T0OUT                  :1;
        unsigned                        :1;
        unsigned T0EN                   :1;
    };
    struct {
        unsigned T0OUTPS0               :1;
        unsigned T0OUTPS1               :1;
        unsigned T0OUTPS2               :1;
        unsigned T0OUTPS3               :1;
    };
} T0CON0bits_t;
extern volatile T0CON0bits_t T0CON0bits __at(0x017);
// bitfield macros
#define _T0CON0_T0OUTPS_POSN                                0x0
#define _T0CON0_T0OUTPS_POSITION                            0x0
#define _T0CON0_T0OUTPS_SIZE                                0x4
#define _T0CON0_T0OUTPS_LENGTH                              0x4
#define _T0CON0_T0OUTPS_MASK                                0xF
#define _T0CON0_T016BIT_POSN                                0x4
#define _T0CON0_T016BIT_POSITION                            0x4
#define _T0CON0_T016BIT_SIZE                                0x1
#define _T0CON0_T016BIT_LENGTH                              0x1
#define _T0CON0_T016BIT_MASK                                0x10
#define _T0CON0_T0OUT_POSN                                  0x5
#define _T0CON0_T0OUT_POSITION                              0x5
#define _T0CON0_T0OUT_SIZE                                  0x1
#define _T0CON0_T0OUT_LENGTH                                0x1
#define _T0CON0_T0OUT_MASK                                  0x20
#define _T0CON0_T0EN_POSN                                   0x7
#define _T0CON0_T0EN_POSITION                               0x7
#define _T0CON0_T0EN_SIZE                                   0x1
#define _T0CON0_T0EN_LENGTH                                 0x1
#define _T0CON0_T0EN_MASK                                   0x80
#define _T0CON0_T0OUTPS0_POSN                               0x0
#define _T0CON0_T0OUTPS0_POSITION                           0x0
#define _T0CON0_T0OUTPS0_SIZE                               0x1
#define _T0CON0_T0OUTPS0_LENGTH                             0x1
#define _T0CON0_T0OUTPS0_MASK                               0x1
#define _T0CON0_T0OUTPS1_POSN                               0x1
#define _T0CON0_T0OUTPS1_POSITION                           0x1
#define _T0CON0_T0OUTPS1_SIZE                               0x1
#define _T0CON0_T0OUTPS1_LENGTH                             0x1
#define _T0CON0_T0OUTPS1_MASK                               0x2
#define _T0CON0_T0OUTPS2_POSN                               0x2
#define _T0CON0_T0OUTPS2_POSITION                           0x2
#define _T0CON0_T0OUTPS2_SIZE                               0x1
#define _T0CON0_T0OUTPS2_LENGTH                             0x1
#define _T0CON0_T0OUTPS2_MASK                               0x4
#define _T0CON0_T0OUTPS3_POSN                               0x3
#define _T0CON0_T0OUTPS3_POSITION                           0x3
#define _T0CON0_T0OUTPS3_SIZE                               0x1
#define _T0CON0_T0OUTPS3_LENGTH                             0x1
#define _T0CON0_T0OUTPS3_MASK                               0x8

